## Creating pandas DataFrames

In [1]:
import pandas as pd

### Creating DataFrames from dictionaries of Series with labels index

In [45]:
items = {'Bob': pd.Series([245, 25, 55], ['bike', 'pants', 'watch']), 
        'Alice': pd.Series([40, 110, 500, 45], ['book', 'glasses', 'bike', 'pants'])
        }

print(f'items type: {type(items)}')
items

items type: <class 'dict'>

{'Bob': bike     245
 pants     25
 watch     55
 dtype: int64,
 'Alice': book        40
 glasses    110
 bike       500
 pants       45
 dtype: int64}

In [46]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

### Creating DataFrames from dictionaries of Series  `without` labels index

In [47]:
data = {'Bob': pd.Series([245, 25, 55]), 'Alic': pd.Series([40, 110, 500, 45])}
data

{'Bob': 0    245
 1     25
 2     55
 dtype: int64,
 'Alic': 0     40
 1    110
 2    500
 3     45
 dtype: int64}

In [48]:
df = pd.DataFrame(data)
df

     Bob  Alic
0  245.0    40
1   25.0   110
2   55.0   500
3    NaN    45

### Extract info from DataFrame using it's attributes

In [49]:
# Get index labels
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [50]:
# Get columns
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [51]:
# Get data (values)
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [52]:
# Get shape
shopping_carts.shape

(5, 2)

In [53]:
# Get n-dimensions
shopping_carts.ndim

2

In [54]:
# Get size (the total num of elements)
shopping_carts.size

10

### Creating DataFrames from from a subset of the data

In [55]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [56]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [59]:
alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

### Create DataFrames from dictionaries of list or arrays

In [60]:
data_num = {
    "Integeres": [1, 2, 3], 
    "Floats": [4.5, 8.2, 9.6]
}

num_df = pd.DataFrame(data_num)
num_df

   Integeres  Floats
0          1     4.5
1          2     8.2
2          3     9.6

### Adding labels on fly

In [61]:
label_num_df = pd.DataFrame(data_num, index=['Label 1', 'Label 2', 'Label 3'])
label_num_df

         Integeres  Floats
Label 1          1     4.5
Label 2          2     8.2
Label 3          3     9.6

### Creating DataFrames using list of dictionaries

In [66]:
list_items = [
    {'bike': 20, 'pants': 30, 'watches': 35},
    {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}
]

store_items = pd.DataFrame(list_items, index=['store 1', 'store 2'])
store_items

         bike  pants  watches  glasses  bikes
store 1  20.0     30       35      NaN    NaN
store 2   NaN      5       10     50.0   15.0